#include<graphics.h> 
#include<conio.h>
#include<stdio.h>

void Draw_flower() {
	int n,i=0;
	scanf_s("%d", &n);
	n *= 200;
	initgraph(960, 640);
	IMAGE flower,sun,sun1,cloud,cloud1,cloud2,cloud3,cloud4,bird;
	loadimage(&flower,_T("folwer.ico"),250,200,true);
	loadimage(&sun, _T("太阳.png"), 100, 100, true);
	loadimage(&sun1, _T("太阳 (1).png"), 100,100, true);
	loadimage(&cloud, _T("云朵.png"), 100, 100, true);
	loadimage(&cloud1, _T("云朵 1.png"),100, 100, true);
	loadimage(&cloud2, _T("云朵2.png"), 100, 100, true);
	loadimage(&cloud3, _T("云朵3.png"), 100, 100, true);
	loadimage(&bird, _T("鸟.png"), 50, 50, true);
	setbkcolor(BLUE);
	cleardevice();

	IMAGE sun2;
	sun2 = sun1;
	while (n--) {
		if (n % 12 == 0)sun2 = sun1;
		setbkcolor(BLUE);
		if (n % 20 == 0) { cleardevice(); i += 10; }
		float H = 190;		// 色相
		float S = 1;		// 饱和度
		float L = 0.7f;		// 亮度
		for (int y = 0,x=0; y < 640||x<960; y++,x++)
		{
			L += 0.0005f;
			setlinecolor(HSLtoRGB(H, S, L));
			line(0, y%640, x, y%640);
		}

		// 画彩虹(通过色相逐渐增加)
		H = 0;
		S = 1;
		L = 0.5f;
		setlinestyle(PS_SOLID, 2);		// 设置线宽为 2
		for (int r = 400; r > 330; r--)
		{
			H += 5;
			setlinecolor(HSLtoRGB(H, S, L));
			circle(959, 639, r);
		}

		rotateimage(&sun2, &sun2, 0.5, BLUE);
		putimage(0, 0, 200, 200, &sun2, 0, 0);
		putimage(150+i%300, 40, 100, 100, &cloud, 0, 0);
		putimage(350+i%300, 10, 100, 100, &cloud1, 0, 0);
		putimage(500+i%300, 70, 100, 100, &cloud2, 0, 0);
		putimage(700+i%300, 50, 100, 100, &cloud3, 0, 0);
		putimage(0+i%500, 200, 50, 50, &bird, 0, 0);
		putimage(80+i%500, 340, 50, 50, &bird, 0, 0);
		Sleep(50);
	}
	closegraph();
	_getch();
}
//int main() { Draw_flower() ; return 0; }

/*
			 ****     ****   size + size%2
		   ******** ********   //size+4
		  *******************  //size+2
		  *******************  //size+2   16+3
		   *****************    17
			 *************    13
			   *********     9
				 *****    5
				   *       1  */
				   /*
						   *****         *****           size      7         col = (size + size % 2 + (size - 3) * 4)*2 + 3  row = (size - 2) * 2 + (col + 1) / 4
						**********     **********        size+5    12  16  20
					  ************** **************       size+4    24
					 *******************************  //size*2+3     48+3
					 *******************************    //size +2  (n-2)*2+ size+(size-2)*4
					 *******************************
					  *****************************
						*************************
						  *********************
							*****************
							  *************
								*********
								  *****
									*              //26行
					*/


					/*					  j<=(size-1 + highness-1)*4+1
									*     num=innum-1 + outnum -1
								  *****   n=num*4+1
								********* kon=(all-n)/2
							  *************
								  *****
								*********
							  *************
							*****************
								*********
							  *************
							*****************
						  **********************
								  *****   n=(highness/2)*2+1
								  *****	  outnum=highness
								  *****
								  *****          //19行
					*/


					/*  			  *
									***
								   *****
								  *******            //size
						 *************************   //
							 *****************
							   *************
							  ***************
							 *******   *******
							****           ****      //余下1
						   *                   *

									 *
									***
								   *****
								  *******
								 *********
					  *******************************   5/10    8/16       9/18
						  ***********************       3/5     4/         5/1
							  ***************
							 ************ *****
							********* *********
						   ******         ******
						  ***                  ***     余下0
						 *	       	    *          *
									  ***
									 *****
									*******
								   *********
								  ***********          //加2
					 *************************************   5/10    8/16       9/18    //6*size+1               5   7   8
						 *****************************       3/5     4/         5/1     //  2*size+1 + 2*size   17  21  25   2 0 1  29  33 57  2  0  1
							 *********************      //减4
							  ****************
							 *************
							**********   **********
						   *******           *******
						  ****                   ****     余下1
						 *                           *
						  */